{
  "site": {
    "title": "Личный блог о изучении языка C и робототехники",
    "subtitle": "Изучаю программирование на C для создания роботов",
    "description": "Добро пожаловать в мой блог! Я только начинаю изучать программирование на языке C и осваивать робототехнику с нуля. Здесь я буду делиться своим опытом работы с микроконтроллерами, такими как Raspberry Pi Pico, своими первыми роботами и простыми проектами на C. Я открыто показываю свои ошибки, маленькие победы и выводы, чтобы другие новички могли учиться вместе со мной. Если вы тоже хотите изучать C и робототехнику с нуля — этот блог для вас."
  },
  "nav": {
    "home": "Главная",
    "blog": "Блог",
    "about": "О блоге",
    "theme": "Тема",
    "theme_light": "☀️ Светлая",
    "theme_dark": "🌙 Темная"
  },
  "home": {
    "view_blog": "Перейти к блогу",
    "features_title": "Что здесь есть",
    "popular": "Популярно",
    "features": {
      "beginner_path": {
        "title": "Путь новичка",
        "description": "Я изучаю программирование на C и робототехнику с нуля и честно делюсь тем, что понимаю и не понимаю."
      },
      "feature_practical": "Практические примеры",
      "feature_detailed": "Подробные разборы",
      "feature_real": "Реальные проекты",
      "robotics_practice": {
        "title": "Робототехника на практике",
        "description": "Работа с микроконтроллерами (Raspberry Pi Pico), датчиками, моторами и простыми роботами."
      },
      "error_analysis": {
        "title": "Разборы ошибок",
        "description": "Ошибки, на которые я натыкаюсь в процессе обучения, и выводы, которые из этого делаю."
      },
      "notes": {
        "title": "Заметки и наблюдения",
        "description": "Короткие записи о том, что оказалось полезным, сложным или неожиданным."
      },
      "community": {
        "title": "Единомышленники",
        "description": "Пространство для новичков и более опытных людей, которым интересно делиться опытом и обсуждать идеи."
      }
    }
  },
  "blog": {
    "title": "Блог о C и робототехнике",
    "subtitle": "Изучаю робототехнику с нуля и ищу единомышленников",
    "description": "Я учусь программировать на C и работать с микроконтроллерами, создавая свои первые роботы. Делюсь тем, что изучаю, ошибками и маленькими победами. Если вам близка робототехника, вы здесь не случайно.</p>"
  },

  "post": {
    "title": "Пост",
    "back": "Назад к списку",
    "translate": "Перевести",
    "translating": "Переводим...",
    "translate_error": "Ошибка перевода"
  },
  "footer": {
    "text": "© 2026 Блог о C и робототехнике"
  },
  "about": {
    "title": "О блоге",
    "subtitle": "Информация о блоге и его развитии",
    "description": "Добро пожаловать на страницу «О блоге»! Здесь я буду публиковать информацию о развитии блога, новых функциях, улучшениях и изменениях.\nЭта страница будет обновляться по мере развития проекта, чтобы вы всегда были в курсе последних новостей и улучшений.\nБлог я развиваю постепенно, экспериментируя с кодом, архитектурой и инструментами, пробуя разные подходы и улучшая то, что уже работает."
  }
}
